# anonymous_keyboard_text = "🕵️ Anonymous Feedback"
# identified_keyboard_text = "🙋 Identified Feedback"
# yes = "✔️ Submit"
# no = "❌ Cancel"

anonymous_keyboard_text = "🕵️ Анонимный отзыв"
identified_keyboard_text = "🙋 Именной отзыв"
yes = "✔️ Отправить"
no = "❌ Отмена"

school_type = {
    '1': "🏫 Чиланзарский филиал",
    '2': "🏫 Филиал \"Самарканд Дарвоза\""
}

people_type = {
    '1': "👨‍🎓 Я — ученик",
    '2': "👩‍👦 Я — родитель ученика",
    '3': "👨‍🏫 Я — учитель",
}

pupil_type = {
    '1': "📘 Начальные классы (1–4)",
    '2': "📗 Старшие классы (5–11)"
}

about = """
📋 О себе
"""